{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "a0a317b2",
   "metadata": {},
   "source": [
    "# Information Content metrika (Data Enrichment)\n",
    "\n",
    "Ovaj notebook demonstrira proces \"obogaćivanja\" (*enrichment*) baze znanja dodavanjem izračunatih težina čvorovima simptoma. Svakom simptomu u grafu pridružuje se težina (Information Content - IC) izračunata na osnovu njegove učestalosti pojavljivanja u celokupnom korpusu bolesti:\n",
    "\n",
    "$$IC = \\log\\left(\\frac{Total\\_Diseases}{Frequency + 1}\\right)$$\n",
    "\n",
    "Zašto koristimo ovu metriku?\n",
    "\n",
    "- **Balansiranje specifičnosti**: Sprečava da generički simptomi (npr. temperatura, umor) potisnu ređe, klinički značajnije simptome (npr. specifični osip),\n",
    "\n",
    "- **Kažnjavanje nespecifičnosti**: Automatski \"kažnjava\" (dodaje manju težinu) simptome koji se pojavljuju u stotinama različitih bolesti, jer oni imaju malu dijagnostičku vrednost,\n",
    "\n",
    "- **Proces razlikovanja**: Omogućava sistemu da logički razlikuje specifične kliničke znake od opštih simptoma, što je temelj za preciznu dijagnozu.\n",
    "\n",
    "Primer:\n",
    "- Simptom \"fever\" (Frequency: 30) će imati nizak IC.\n",
    "- Simptom \"dysphonia\" (Frequency: 2) će imati visok IC."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1823ac41",
   "metadata": {},
   "source": [
    "## Instalacija paketa"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ec491302",
   "metadata": {},
   "outputs": [],
   "source": [
    "%pip install neo4j python-dotenv"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "11ee960f",
   "metadata": {},
   "source": [
    "# Konekcija sa graf bazom"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "1bc1f194",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from neo4j import GraphDatabase\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "load_dotenv()\n",
    "\n",
    "neo4j_url = os.getenv(\"NEO4J_URL\")\n",
    "neo4j_username = os.getenv(\"NEO4J_USERNAME\")\n",
    "neo4j_password = os.getenv(\"NEO4J_PASSWORD\")\n",
    "\n",
    "driver = GraphDatabase.driver(neo4j_url, auth=(neo4j_username, neo4j_password))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5eee3962",
   "metadata": {},
   "source": [
    "## Ukupan broj bolesti (Total Corpus)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "1f66e1c5",
   "metadata": {},
   "outputs": [],
   "source": [
    "total_diseases = 0\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(\"\"\"\n",
    "     MATCH (d:Disease) \n",
    "     RETURN count(d) as total_diseases\n",
    "    \"\"\")\n",
    "    total_diseases = result.single()[\"total_diseases\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "fbe94380",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "14460"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "total_diseases"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "25f6b6ec",
   "metadata": {},
   "source": [
    "## Računanje i upisivanje težine (IDF) za svaki simptom"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "1922e153",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Uspešno izračunato i upisano težina za 305 simptoma.\n"
     ]
    }
   ],
   "source": [
    "with driver.session() as session:\n",
    "    has_symptom_uri = \"http://purl.obolibrary.org/obo/RO_0002452\"\n",
    "\n",
    "    result = session.run(\"\"\"\n",
    "        MATCH (s:Symptom)<-[r:n4sch__SCO_RESTRICTION]-(d:Disease)\n",
    "        WHERE r.onPropertyURI = $has_symptom_uri\n",
    "        \n",
    "        WITH s, count(d) AS disease_frequency\n",
    "        \n",
    "        WITH s, log(toFloat($total_diseases) / (disease_frequency + 1)) AS ic_score\n",
    "        \n",
    "        SET s.weight = ic_score\n",
    "        \n",
    "        RETURN count(s) as symptoms_updated\n",
    "    \"\"\", has_symptom_uri=has_symptom_uri, total_diseases=total_diseases)\n",
    "\n",
    "    updated_count = result.single()[\"symptoms_updated\"]\n",
    "    print(f\"Uspešno izračunato i upisano težina za {updated_count} simptoma.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "9ffc3772",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "   - hypergammaglobulinemia: 8.8860\n",
      "   - papular rash: 8.8860\n",
      "   - dysphonia: 8.8860\n",
      "   - bronchopulmonary bleeding: 8.8860\n",
      "   - alteration of consciousness: 8.8860\n",
      "   - decreased appetite: 8.8860\n",
      "   - bloody stool: 8.8860\n",
      "   - low blood pressure: 8.8860\n",
      "   - melena: 8.8860\n",
      "   - memory impairment: 8.8860\n",
      "   - descending muscle paralysis: 8.8860\n",
      "   - urinary incontinence: 8.8860\n",
      "   - hydrocephalus: 8.8860\n",
      "   - facial paralysis: 8.8860\n",
      "   - anal abscess: 8.8860\n",
      "   - nystagmus: 8.8860\n",
      "   - bone conduction hyperacusis: 8.8860\n",
      "   - feeding problem: 8.8860\n",
      "   - hyperesthesia: 8.8860\n",
      "   - agitation: 8.8860\n",
      "   - acquired color vision deficiency: 8.8860\n",
      "   - lesions in mouth: 8.8860\n",
      "   - diaphoresis: 8.8860\n",
      "   - sneezing: 8.8860\n",
      "   - decreased metabolism: 8.8860\n",
      "   - epididymitis: 8.8860\n",
      "   - lesions in lung: 8.8860\n",
      "   - hepatic abscess: 8.8860\n",
      "   - weight gain: 8.8860\n",
      "   - cachexia: 8.8860\n",
      "   - loss of height: 8.8860\n",
      "   - hypothermia: 8.8860\n",
      "   - hypersomnia: 8.8860\n",
      "   - dry mouth: 8.8860\n",
      "   - muscle tightness: 8.8860\n",
      "   - exhaustion: 8.8860\n",
      "   - corkscrew hair: 8.8860\n",
      "   - conjunctival swelling: 8.8860\n",
      "   - acute dyspnea: 8.8860\n",
      "   - poor wound healing: 8.8860\n",
      "   - anterior scleral inflammation: 8.8860\n",
      "   - splitting of urinary stream: 8.8860\n",
      "   - leg swelling: 8.8860\n",
      "   - anaphylactic shock: 8.8860\n",
      "   - corneal opacity: 8.8860\n",
      "   - dysuria: 8.8860\n",
      "   - hoarse voice: 8.8860\n",
      "   - hypoxemia: 8.8860\n",
      "   - abnormal behavior: 8.8860\n",
      "   - cellulitis: 8.8860\n",
      "   - dyspareunia: 8.8860\n",
      "   - hemorrhage into skin: 8.8860\n",
      "   - right lower quadrant abdominal tenderness: 8.8860\n",
      "   - caseation: 8.8860\n",
      "   - limited attention: 8.8860\n",
      "   - motor weakness: 8.8860\n",
      "   - severe abdominal cramp: 8.8860\n",
      "   - agraphia: 8.8860\n",
      "   - sleep apnea: 8.8860\n",
      "   - mouth papules: 8.8860\n",
      "   - cornea symptom: 8.8860\n",
      "   - hepatitis: 8.8860\n",
      "   - depression: 8.8860\n",
      "   - mouth sore: 8.8860\n",
      "   - contracture: 8.8860\n",
      "   - hand weakness: 8.8860\n",
      "   - conjunctival suffusion: 8.8860\n",
      "   - mouth bleeding: 8.8860\n",
      "   - abdominal swelling: 8.8860\n",
      "   - muscle tenderness: 8.8860\n",
      "   - atrial fibrillation: 8.8860\n",
      "   - lightheadedness: 8.8860\n",
      "   - urinary urgency: 8.8860\n",
      "   - shoulder pain: 8.8860\n",
      "   - neck pain: 8.8860\n",
      "   - ageusia: 8.8860\n",
      "   - underweight: 8.8860\n",
      "   - facial weakness: 8.8860\n",
      "   - muscle cramp: 8.8860\n",
      "   - hyperreflexia: 8.8860\n",
      "   - pallor: 8.8860\n",
      "   - conjunctival degeneration: 8.8860\n",
      "   - epigastric abdominal pain: 8.8860\n",
      "   - abnormal scar formation: 8.8860\n",
      "   - abnormal wound healing: 8.8860\n",
      "   - pulmonary edema: 8.8860\n",
      "   - aphasia: 8.8860\n",
      "   - bloody sputum: 8.8860\n",
      "   - bronchospasm: 8.8860\n",
      "   - cerebrovascular accident: 8.8860\n",
      "   - poor feeding: 8.8860\n",
      "   - sinus bradycardia: 8.8860\n",
      "   - cloudy cornea: 8.8860\n",
      "   - corneal scarring: 8.8860\n",
      "   - abnormal vaginal bleeding: 8.8860\n",
      "   - decreased tearing: 8.8860\n",
      "   - pneumonitis: 8.8860\n",
      "   - limb weakness: 8.8860\n",
      "   - repetitive behavior: 8.8860\n",
      "   - patches of hair loss with a black dot pattern: 8.8860\n",
      "   - exophthalmos: 8.8860\n",
      "   - congestion: 8.8860\n",
      "   - hyperventilation: 8.8860\n",
      "   - boil: 8.8860\n",
      "   - airway stenosis: 8.8860\n",
      "   - peripheral muscle weakness: 8.8860\n",
      "   - skin ulcer: 8.8860\n",
      "   - encephalitis: 8.8860\n",
      "   - joint inflammation: 8.8860\n",
      "   - nephritis: 8.8860\n",
      "   - paraplegia: 8.8860\n",
      "   - spasticity: 8.8860\n",
      "   - bone pain: 8.4805\n",
      "   - wet cough: 8.4805\n",
      "   - hyperthermia: 8.4805\n",
      "   - oliguria: 8.4805\n",
      "   - skin peeling: 8.4805\n",
      "   - gangrene: 8.4805\n",
      "   - chest discomfort: 8.4805\n",
      "   - tiredness: 8.4805\n",
      "   - abdominal distention: 8.4805\n",
      "   - hind limb paralysis: 8.4805\n",
      "   - concentration difficulty: 8.4805\n",
      "   - insomnia: 8.4805\n",
      "   - rectorrhagia: 8.4805\n",
      "   - keratitis: 8.4805\n",
      "   - flaccidity: 8.4805\n",
      "   - lymphopenia: 8.4805\n",
      "   - right lower quadrant abdominal pain: 8.4805\n",
      "   - delayed psychomotor development: 8.4805\n",
      "   - abdominal mass: 8.4805\n",
      "   - stridor: 8.4805\n",
      "   - vascular alteration: 8.4805\n",
      "   - severe chest pain: 8.4805\n",
      "   - conjunctival congestion: 8.4805\n",
      "   - spastic paralysis: 8.4805\n",
      "   - leukocytosis: 8.4805\n",
      "   - sleep disturbance: 8.4805\n",
      "   - pleural effusion: 8.4805\n",
      "   - bradycardia: 8.4805\n",
      "   - emaciation: 8.4805\n",
      "   - tinnitus: 8.4805\n",
      "   - vasculitis: 8.4805\n",
      "   - anasarca: 8.4805\n",
      "   - syncope: 8.4805\n",
      "   - dark urine: 8.4805\n",
      "   - chronic inflammation: 8.4805\n",
      "   - abdominal tenderness: 8.4805\n",
      "   - hyperactivity: 8.4805\n",
      "   - cyanosis: 8.4805\n",
      "   - pericardial effusion: 8.4805\n",
      "   - night sweats: 8.4805\n",
      "   - palpitation: 8.4805\n",
      "   - cytopenia: 8.4805\n",
      "   - apthous ulcer: 8.4805\n",
      "   - lymph gland swelling: 8.4805\n",
      "   - nasal bleeding: 8.4805\n",
      "   - cervical lymphadenopathy: 8.4805\n",
      "   - ascites: 8.1928\n",
      "   - hoarseness: 8.1928\n",
      "   - pleuritic chest pain: 8.1928\n",
      "   - flaccid paralysis: 8.1928\n",
      "   - eczema: 8.1928\n",
      "   - delirium: 8.1928\n",
      "   - prostration: 8.1928\n",
      "   - hematuria: 8.1928\n",
      "   - lymphangitis: 8.1928\n",
      "   - acute pain: 8.1928\n",
      "   - loss of balance: 8.1928\n",
      "   - hair loss: 8.1928\n",
      "   - dyspepsia: 8.1928\n",
      "   - hemiparesis: 8.1928\n",
      "   - asthenia: 8.1928\n",
      "   - blister: 8.1928\n",
      "   - steatorrhea: 8.1928\n",
      "   - swelling symptom: 8.1928\n",
      "   - sensory disturbance: 8.1928\n",
      "   - severe diarrhea: 8.1928\n",
      "   - flushing: 8.1928\n",
      "   - renal failure: 8.1928\n",
      "   - altered mental status: 8.1928\n",
      "   - blindness: 8.1928\n",
      "   - double vision: 8.1928\n",
      "   - hypotension: 8.1928\n",
      "   - memory loss: 8.1928\n",
      "   - papule: 8.1928\n",
      "   - abnormality of gait: 8.1928\n",
      "   - phlebitis: 7.9697\n",
      "   - endocarditis: 7.9697\n",
      "   - menorrhagia: 7.9697\n",
      "   - gum bleeding: 7.9697\n",
      "   - relapsing fever: 7.9697\n",
      "   - low white blood cell count: 7.9697\n",
      "   - gastrointestinal bleeding: 7.9697\n",
      "   - convulsion: 7.9697\n",
      "   - petechiae: 7.9697\n",
      "   - failure to thrive: 7.9697\n",
      "   - meningitis: 7.9697\n",
      "   - proteinuria: 7.9697\n",
      "   - hematochezia: 7.9697\n",
      "   - arrhythmia: 7.9697\n",
      "   - cramp: 7.9697\n",
      "   - hepatic dysfunction: 7.9697\n",
      "   - urticaria: 7.9697\n",
      "   - chest tightness: 7.9697\n",
      "   - anxiety: 7.9697\n",
      "   - stupor: 7.9697\n",
      "   - granulomatous inflammation: 7.9697\n",
      "   - body ache: 7.9697\n",
      "   - dry cough: 7.9697\n",
      "   - severe headache: 7.9697\n",
      "   - bloating: 7.7874\n",
      "   - hemoptysis: 7.7874\n",
      "   - high blood pressure: 7.7874\n",
      "   - acholic stool: 7.7874\n",
      "   - vertigo: 7.7874\n",
      "   - hematemesis: 7.7874\n",
      "   - tremor: 7.7874\n",
      "   - epistaxis: 7.7874\n",
      "   - disorientation: 7.7874\n",
      "   - rhinorrhea: 7.7874\n",
      "   - abdominal discomfort: 7.7874\n",
      "   - lymphadenitis: 7.7874\n",
      "   - myocarditis: 7.6332\n",
      "   - drowsiness: 7.6332\n",
      "   - low-grade fever: 7.6332\n",
      "   - thrombocytopenia: 7.6332\n",
      "   - irritability: 7.6332\n",
      "   - tachycardia: 7.6332\n",
      "   - ventricular tachycardia: 7.6332\n",
      "   - edema: 7.6332\n",
      "   - dehydration: 7.6332\n",
      "   - arthritis: 7.6332\n",
      "   - skin desquamation: 7.6332\n",
      "   - tachypnea: 7.6332\n",
      "   - polyuria: 7.4997\n",
      "   - splenomegaly: 7.4997\n",
      "   - hallucination: 7.4997\n",
      "   - lethargy: 7.3819\n",
      "   - constipation: 7.3819\n",
      "   - dysarthria: 7.3819\n",
      "   - short stature: 7.3819\n",
      "   - chronic cough: 7.3819\n",
      "   - conjunctivitis: 7.3819\n",
      "   - wheezing: 7.2766\n",
      "   - anemia: 7.2766\n",
      "   - liver inflammation: 7.2766\n",
      "   - itching: 7.1812\n",
      "   - stiff neck: 7.1812\n",
      "   - high fever: 7.1812\n",
      "   - abdominal cramp: 7.1812\n",
      "   - paresthesia: 7.1812\n",
      "   - photophobia: 7.1812\n",
      "   - backache: 7.0942\n",
      "   - paralysis: 7.0942\n",
      "   - eschar: 7.0942\n",
      "   - shock: 7.0942\n",
      "   - jaundice: 7.0942\n",
      "   - breathing problems: 7.0942\n",
      "   - ataxia: 7.0942\n",
      "   - heart failure: 7.0142\n",
      "   - hemorrhage: 7.0142\n",
      "   - coma: 7.0142\n",
      "   - hepatomegaly: 7.0142\n",
      "   - dizziness: 7.0142\n",
      "   - left upper quadrant abdominal rigidity: 7.0142\n",
      "   - chest pain: 7.0142\n",
      "   - enlargement of lymph nodes: 6.9401\n",
      "   - dysphagia: 6.8711\n",
      "   - maculopapular rash: 6.8711\n",
      "   - skin lesion: 6.8711\n",
      "   - weakness: 6.8711\n",
      "   - loss of vision: 6.8711\n",
      "   - anorexia: 6.8066\n",
      "   - confusion: 6.7459\n",
      "   - abscess: 6.7459\n",
      "   - lymphadenopathy: 6.6888\n",
      "   - pharynx inflammation: 6.6347\n",
      "   - loss of appetite: 6.6347\n",
      "   - hepatosplenomegaly: 6.6347\n",
      "   - muscle pain: 6.6347\n",
      "   - bloodshot eye: 6.5834\n",
      "   - seizure: 6.5346\n",
      "   - malaise: 6.5346\n",
      "   - allergic reaction: 6.4881\n",
      "   - dyspnea: 6.4436\n",
      "   - necrosis: 6.4011\n",
      "   - weight loss: 6.4011\n",
      "   - ptosis: 6.3603\n",
      "   - pain: 6.2469\n",
      "   - rash: 6.1134\n",
      "   - joint pain: 6.0528\n",
      "   - progressive weakness: 6.0238\n",
      "   - chills: 5.9416\n",
      "   - abdominal pain: 5.8179\n",
      "   - fatigue: 5.7950\n",
      "   - bleeding: 5.6088\n",
      "   - nausea: 5.5902\n",
      "   - cough: 5.4203\n",
      "   - vomiting: 5.2353\n",
      "   - diarrhea: 5.1847\n",
      "   - inflammation: 5.1483\n",
      "   - headache: 4.9740\n",
      "   - muscle weakness: 4.7350\n",
      "   - fever: 4.5422\n"
     ]
    }
   ],
   "source": [
    "with driver.session() as session:\n",
    "    result = session.run(\"\"\"\n",
    "        MATCH (s:Symptom)\n",
    "        WHERE s.weight IS NOT NULL\n",
    "        RETURN s.n4sch__label[0] AS naziv, s.weight AS tezina\n",
    "        ORDER BY s.weight DESC\n",
    "    \"\"\")\n",
    "\n",
    "    for record in result:\n",
    "        print(f\"   - {record['naziv']}: {record['tezina']:.4f}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "NeSy Notebooks (venv)",
   "language": "python",
   "name": "nesy-notebooks"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
